In [2]:
import sqlite3
import pandas as pd

In [29]:
conn = sqlite3.connect('students.db')
c = conn.cursor()

In [30]:
c.execute('''CREATE TABLE courses (
    code_module VARCHAR(3), 
    code_presentation VARCHAR(5), 
    module_presentation_length INT
    )'''
)

In [31]:
courses = pd.read_csv('courses.csv')
courses.to_sql('courses',conn, if_exists='append', index = False)

In [32]:
c.execute('''SELECT * from courses''').fetchall()

[('AAA', '2013J', 268),
 ('AAA', '2014J', 269),
 ('BBB', '2013J', 268),
 ('BBB', '2014J', 262),
 ('BBB', '2013B', 240),
 ('BBB', '2014B', 234),
 ('CCC', '2014J', 269),
 ('CCC', '2014B', 241),
 ('DDD', '2013J', 261),
 ('DDD', '2014J', 262),
 ('DDD', '2013B', 240),
 ('DDD', '2014B', 241),
 ('EEE', '2013J', 268),
 ('EEE', '2014J', 269),
 ('EEE', '2014B', 241),
 ('FFF', '2013J', 268),
 ('FFF', '2014J', 269),
 ('FFF', '2013B', 240),
 ('FFF', '2014B', 241),
 ('GGG', '2013J', 261),
 ('GGG', '2014J', 269),
 ('GGG', '2014B', 241)]

In [33]:
c.execute('''
CREATE TABLE studentRegistration (
    code_module varchar(3), 
    code_presentation varchar(5), 
    id_student varchar,
    date_registration date,
    date_unregistration date,
    FOREIGN KEY(id_student) REFERENCES studentInfo(id_student)
    )
''')

In [ ]:
studentRegistration = pd.read_csv('studentRegistration.csv')
studentRegistration.to_sql('studentRegistration',conn, if_exists='append', index = False)
c.execute('''SELECT * from studentRegistration''').fetchall()

In [35]:
c.execute('''
CREATE TABLE assessments (
    code_module varchar(3), 
    code_presentation varchar(5), 
    id_assessment varchar PRIMARY KEY,
    assessment_type varchar,
    date int,
    weight int
    )
''')

In [ ]:
assessments = pd.read_csv('assessments.csv')
assessments.to_sql('assessments',conn, if_exists='append', index = False)
c.execute('''SELECT * from assessments''').fetchall()

In [37]:
c.execute('''
CREATE TABLE vle(
    id_site varchar PRIMARY KEY,
    code_module varchar(3), 
    code_presentation varchar(5), 
    activity_type TEXT,
    week_from INT,
    week_to INT
    )
''')

In [ ]:
vle = pd.read_csv('vle.csv')
vle.to_sql('vle',conn, if_exists='append', index = False)
c.execute('''SELECT * from vle''').fetchall()

In [39]:
c.execute('''
CREATE TABLE studentAssessment(
    id_assessment VARCHAR,
    id_student VARCHAR,
    date_submitted DATE,
    is_banked INT,
    score INT,
    FOREIGN KEY(id_assessment) REFERENCES studentInfo(id_student)
    )
''')

In [ ]:
studentAssessment = pd.read_csv('studentAssessment.csv')
studentAssessment.to_sql('studentAssessment',conn, if_exists='append', index = False)
c.execute('''SELECT * from studentAssessment''').fetchall()

In [41]:
c.execute('''
CREATE TABLE studentInfo(
    code_module varchar(3), 
    code_presentation varchar(5),
    id_student VARCHAR,
    gender CHAR,
    region TEXT,
    highest_education TEXT,
    imd_band FLOAT,
    age_band INT,
    num_of_prev_attempts INT,
    studied_credits INT,
    disability CHAR,
    final_result VARCHAR
    )
''')

In [ ]:
studentInfo = pd.read_csv('studentInfo.csv')
studentInfo.to_sql('studentInfo',conn, if_exists='append', index = False)
c.execute('''SELECT * from studentInfo''').fetchall()

In [46]:
df = pd.read_sql_query ('''
SELECT id_student, region, code_module, code_presentation
FROM studentInfo
WHERE code_presentation='2014B'
''',conn)
df

     id_student                region code_module code_presentation
0         23641      Yorkshire Region         GGG             2014B
1         23647   East Anglian Region         DDD             2014B
2         23659  North Western Region         EEE             2014B
3         23671              Scotland         BBB             2014B
4         23674         London Region         BBB             2014B
...         ...                   ...         ...               ...
7799     735459  East Midlands Region         FFF             2014B
7800     735479     South East Region         FFF             2014B
7801     735539     South West Region         DDD             2014B
7802     735559                 Wales         CCC             2014B
7803     735639  North Western Region         DDD             2014B

[7804 rows x 4 columns]

In [ ]:
df.to_excel(excel_writer='Test.xls')

<ipython-input-44-2d0ec6eb07d0>:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel(excel_writer='Test.xls')